config.org
#+TITLE: Emacs Configurations
#+AUTHOR: Sean Ni
#+DATE: <2018-02-15 Thu>

* Emacs built-in

** Font

   #+BEGIN_SRC emacs-lisp :tangle yes
     (cond ((eq system-type 'windows-nt)
            (set-face-attribute 'default nil :font "Consolas" :height 143))
           ((eq system-type 'darwin)
            ;; (set-face-attribute 'default nil :font "Menlo" :height 143))
            (set-face-attribute 'default nil :family "Source Code Pro" :foundry "ADBO" :height 160)) ; t for default case
           ;; (t (set-face-attribute 'default nil :font "Courier 10 Pitch" :height 136)) ; t for default case
           ;; looks like gnu/linux is not working in system-type
           (t (set-face-attribute 'default nil :family "Source Code Pro" :foundry "ADBO" :height 136)) ; t for default case
           )
   #+END_SRC

** Appearance and behavior
   #+BEGIN_SRC emacs-lisp :tangle yes
     (prefer-coding-system 'utf-8-unix)
     (blink-cursor-mode -1)
     (column-number-mode 1)                  ; display column number in modeline
     (display-time-mode 1)
     (cond ((eq system-type 'darwin))
           (t (menu-bar-mode -1)))
     (scroll-bar-mode -1)
     (show-paren-mode 1)                     ; highlight matching parenthese
     (tool-bar-mode -1)
     (which-function-mode 1)                 ; display function name in modeline
     (fset 'yes-or-no-p 'y-or-n-p)           ; simplify this
     (setq-default indent-tabs-mode nil)     ; use space instead of tabs (setq: buffer local var, setq-default global)
     (setq initial-scratch-message ";; Put your mess here\n\n")
     (setq inhibit-startup-message nil)
     (setq inhibit-startup-screen t)
     (setq large-file-warning-threshold 100000000)
     (setq scroll-step 1)                    ; don't suddenly roll up a lot of lines
     (setq tab-width 4)
     (setq visible-bell t)                   ; flash screen instead of audible ding
     (if (eq system-type 'darwin)
         (progn
           (setq ns-command-modifier (quote control))
           (setq ns-right-command-modifier (quote meta))))
     (put 'narrow-to-region 'disabled nil)
     (put 'downcase-region 'disabled nil)
     (global-auto-revert-mode 1)             ;could be more traffic/network
   #+END_SRC

** org-mode

*** org indent mode
Either this or add =#+STARTUP: indent= to the file
#+BEGIN_SRC emacs-lisp :tangle yes
  (add-hook 'org-mode-hook 'org-indent-mode)
#+END_SRC

*** install latest org mode
    stock emacs comes with very old version of org-mode, to upgrade org-mode, first =emacs -q=, then =eval-region= below code, then package list, find org (and possibly org-plus-contrib) and install it. sometimes direct =package-install= command won't work so you have resort to the =package-list= method.
    #+BEGIN_SRC emacs-lisp :tangle no
      (require 'package)
      (add-to-list 'package-archives '("org" . "https://orgmode.org/elpa/") t)
    #+END_SRC
*** use line wrap and speed commands
   #+BEGIN_SRC emacs-lisp :tangle yes
     (setq org-startup-truncated nil)        ; tell org mode to wrap line instead of shift
     (setq org-use-speed-commands t)         ; use single key to navigate
   #+END_SRC

*** global keys to activate org capture and agenda
   #+BEGIN_SRC emacs-lisp :tangle yes
     (global-set-key (kbd "C-c l") 'org-store-link)
     (global-set-key (kbd "C-c a") 'org-agenda)
     (global-set-key (kbd "C-c c") 'org-capture)
     (global-set-key (kbd "C-c b") 'org-switchb)
   #+END_SRC

*** org refile
    Check this [[https://blog.aaronbieber.com/2017/03/19/organizing-notes-with-refile.html][Blog post]] for the first 4 ~setq~ down below for some tricks when doing ~org-refile~
    #+BEGIN_SRC emacs-lisp :tangle yes
     ;; refile across files, otherwise can only refile within the same file
     (setq org-refile-targets '((org-agenda-files :maxlevel . 3)))
     ;; refile as the top heading, otherwise can only refile as the child of existing headings
     (setq org-refile-use-outline-path 'file)
     ;; refile list all possibilities at once, not the default step by step, for helm
     (setq org-outline-path-complete-in-steps nil)
     ;; refile can create new parent, must add "/New Heading" at the end
     (setq org-refile-allow-creating-parent-nodes 'confirm)

    #+END_SRC

*** org capture and agenda settings

   #+BEGIN_SRC emacs-lisp :tangle yes
     (cond
      ((string-equal system-type "windows-nt")
       (setq org-agenda-path "u:/Documents/org/")) ; this is Windows map of /usr2/xni
      (t
       (setq org-agenda-path "~/Documents/org/")))

     (setq org-todo-file (concat org-agenda-path "todo.org"))
     (setq org-notes-file (concat org-agenda-path "notes.org"))
     (setq org-log-file (concat org-agenda-path "log.org"))
     (setq org-finance-file (concat org-agenda-path "finance.org"))
     (setq org-travel-file (concat org-agenda-path "travel.org"))

     ;; (setq org-agenda-files (list
     ;;                         org-todo-file
     ;;                         org-notes-file
     ;;                         org-log-file
     ;;                         ))

     (setq org-agenda-files (directory-files-recursively org-agenda-path "\.org$"))

     (setq org-capture-templates
           (quote (
                   ("t" "TODO" entry (file org-todo-file)
                    "* TODO %^{Title} %^G\n:PROPERTIES:\n:INCEPTION: %T\n:END:\n%?" :prepend t)

                   ("l" "Work Log" entry (file org-log-file)
                    "* Week %t \t:worklog:\n%?")

                   ("n" "Notes" entry (file org-notes-file)
                   "* %^{Title} %^G\n:PROPERTIES:\n:INCEPTION: %U\n:END:\n%?")
                   )))
   #+END_SRC

   #+RESULTS:
   | t | TODO | entry | (file org-todo-file) | * TODO %^{Title} %^G |

*** calendar and diary
    #+BEGIN_SRC emacs-lisp :tangle yes
      (setq org-agenda-include-diary t)
    #+END_SRC

*** closing todo items
    #+BEGIN_SRC emacs-lisp :tangle yes
      (setq org-log-done 'time)
    #+END_SRC

*** customize todo keywords
    #+BEGIN_SRC emacs-lisp :tangle yes
      ;; (setq org-todo-keywords '(
      ;;                           (sequence "TODO" "|" "DONE" "POSTPONE" "ABANDONED") ; for normal stuff
      ;;                           (sequence "CR" "|" "FIXED" "NOT-A-BUG") ; for bug
      ;;                           ))
      (setq org-todo-keywords
            '(;; Sequence for TASKS
              ;; TODO means it's an item that needs addressing
              ;; WAITING means it's dependent on something else happening
              ;; DELEGATED means someone else is doing it and I need to follow up with them
              ;; ASSIGNED means someone else has full, autonomous responsibility for it
              ;; CANCELLED means it's no longer necessary to finish
              ;; DONE means it's complete
              (sequence "TODO(t@/!)" "WAITING(w@/!)" "DELEGATED(e@/!)" "|" "ASSIGNED(a@/!)" "CANCELLED(c@/!)" "DONE(d@/!)")
              ))
      ;; put - STATE change from xx to xx into drawer so when export,
      ;; these state changes won't be exported
      (setq org-log-into-drawer t)
    #+END_SRC

*** dropped easy template
from v9.2, org mode got rid of easy template (<s thing), you can get it back by
#+begin_src emacs-lisp :tangle no
(require 'org-tempo)
#+end_src
but the new replacement is good too. C-c C-, and choose from the pop up list

*** org babel
#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-babel-load-languages
        (quote
         ((emacs-lisp . t)
          (shell . t)
          (python . t)
          (awk . t)
          (C . t)
          (java . t)
          (latex . t)
          (makefile . t)
          (octave . t))))
  #+END_SRC
*** org export
#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-export-backends (quote (ascii html latex man md odt groff)))
#+END_SRC
*** org keys
When you use =C-c C-o= to follow links, if the link is within the document, you can use this command to go back. There is another command =org-mark-ring-push=, which was originally bind to this key.
#+BEGIN_SRC emacs-lisp :tangle yes
  (require 'org)
  (define-key org-mode-map (kbd "C-c %") 'org-mark-ring-goto)
#+END_SRC
** Backup files
   #+BEGIN_SRC emacs-lisp :tangle yes
     ;; Remove all backup files
     ;; (setq make-backup-files nil)
     ;; (setq backup-inhibited t)
     ;; (setq auto-save-default nil)
     ;; or alternatively
     (setq backup-directory-alist '(("." . "~/.saves")))
   #+END_SRC

** Language Settings

*** C

    #+BEGIN_SRC emacs-lisp :tangle yes
      (setq-default c-default-style "linux")
      (setq-default c-basic-offset 4)
      (c-set-offset 'case-label '+)           ; fix case index
    #+END_SRC

*** python
    #+BEGIN_SRC emacs-lisp :tangle yes
      (setq python-indent-offset 4)
    #+END_SRC

*** Scons
    #+BEGIN_SRC emacs-lisp :tangle yes
      (add-to-list 'auto-mode-alist '("\\.scons\\'" . python-mode))
      (add-to-list 'auto-mode-alist '("\\.api\\'" . python-mode))
    #+END_SRC

*** makefile
#+BEGIN_SRC emacs-lisp :tangle yes
  (add-to-list 'auto-mode-alist '("\\.mak\\'" . makefile-mode))
#+END_SRC
** dired
*** dired-jump
   load dired key bindings (C-x C-j to go to file location in dired mode)
   #+BEGIN_SRC emacs-lisp :tangle yes
     (require 'dired-x)
   #+END_SRC
*** dired copy files
   With this option on, Emacs automatically copies marked files to another opened dired in another window
   #+BEGIN_SRC emacs-lisp :tangle yes
     (setq dired-dwim-target t)
   #+END_SRC

** XML completion
   #+BEGIN_SRC emacs-lisp :tangle yes
     (setq nxml-slash-auto-complete-flag t)
   #+END_SRC

** whitespace cleanup
   #+BEGIN_SRC emacs-lisp :tangle yes
     (add-hook 'before-save-hook 'whitespace-cleanup)
     (add-hook 'before-save-hook (lambda() (delete-trailing-whitespace)))
   #+END_SRC

