config.el
(cond ((eq system-type 'windows-nt)
       (set-face-attribute 'default nil :font "Consolas" :height 143))
      ((eq system-type 'darwin)
       ;; (set-face-attribute 'default nil :font "Menlo" :height 143))
       (set-face-attribute 'default nil :family "Source Code Pro" :foundry "ADBO" :height 160)) ; t for default case
      ;; (t (set-face-attribute 'default nil :font "Courier 10 Pitch" :height 136)) ; t for default case
      ;; looks like gnu/linux is not working in system-type
      (t (set-face-attribute 'default nil :family "Source Code Pro" :foundry "ADBO" :height 136)) ; t for default case
      )

(prefer-coding-system 'utf-8-unix)
(blink-cursor-mode -1)
(column-number-mode 1)                  ; display column number in modeline
;; (display-time-mode 1)                ; disable this to save some modeline space for 2 column views
(cond ((eq system-type 'darwin))
      (t (menu-bar-mode -1)))
(scroll-bar-mode -1)
(show-paren-mode 1)                     ; highlight matching parenthese
(tool-bar-mode -1)
(which-function-mode 1)                 ; display function name in modeline
(fset 'yes-or-no-p 'y-or-n-p)           ; simplify this
(setq-default indent-tabs-mode nil)     ; use space instead of tabs (setq: buffer local var, setq-default global)
(setq initial-scratch-message ";; Put your mess here\n\n")
(setq inhibit-startup-message nil)
(setq inhibit-startup-screen t)
(setq large-file-warning-threshold 100000000)
(setq scroll-step 1)                    ; don't suddenly roll up a lot of lines
(setq tab-width 4)
(setq visible-bell t)                   ; flash screen instead of audible ding
(if (eq system-type 'darwin)
    (progn
      (setq ns-command-modifier (quote control))
      (setq ns-right-command-modifier (quote meta))))
(put 'narrow-to-region 'disabled nil)
(put 'downcase-region 'disabled nil)
(global-auto-revert-mode 1)             ;could be more traffic/network

(add-hook 'org-mode-hook 'org-indent-mode)

(setq org-startup-truncated nil)        ; tell org mode to wrap line instead of shift
(setq org-use-speed-commands t)         ; use single key to navigate

(global-set-key (kbd "C-c l") 'org-store-link)
(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key (kbd "C-c c") 'org-capture)
(global-set-key (kbd "C-c b") 'org-switchb)

;; refile across files, otherwise can only refile within the same file
(setq org-refile-targets '((org-agenda-files :maxlevel . 3)))
;; refile as the top heading, otherwise can only refile as the child of existing headings
(setq org-refile-use-outline-path 'file)
;; refile list all possibilities at once, not the default step by step, for helm
(setq org-outline-path-complete-in-steps nil)
;; refile can create new parent, must add "/New Heading" at the end
(setq org-refile-allow-creating-parent-nodes 'confirm)

(cond
 ((string-equal system-type "windows-nt")
  (setq org-agenda-path "u:/Documents/org/")) ; this is Windows map of /usr2/xni
 (t
  (setq org-agenda-path "~/Documents/org/")))

(setq org-todo-file (concat org-agenda-path "todo.org"))
(setq org-notes-file (concat org-agenda-path "notes.org"))
(setq org-log-file (concat org-agenda-path "log.org"))
(setq org-finance-file (concat org-agenda-path "finance.org"))
(setq org-travel-file (concat org-agenda-path "travel.org"))

;; (setq org-agenda-files (list
;;                         org-todo-file
;;                         org-notes-file
;;                         org-log-file
;;                         ))

(setq org-agenda-files (directory-files-recursively org-agenda-path "\.org$"))

(setq org-capture-templates
      (quote (
              ("t" "TODO" entry (file org-todo-file)
               "* TODO %^{Title} %^G\n:PROPERTIES:\n:INCEPTION: %T\n:END:\n%?" :prepend t)

              ("l" "Work Log" entry (file org-log-file)
               "* Week %t \t:worklog:\n%?")

              ("n" "Notes" entry (file org-notes-file)
              "* %^{Title} %^G\n:PROPERTIES:\n:INCEPTION: %U\n:END:\n%?")
              )))

(setq org-agenda-include-diary t)

(setq org-log-done 'time)

;; (setq org-todo-keywords '(
;;                           (sequence "TODO" "|" "DONE" "POSTPONE" "ABANDONED") ; for normal stuff
;;                           (sequence "CR" "|" "FIXED" "NOT-A-BUG") ; for bug
;;                           ))
(setq org-todo-keywords
      '(;; Sequence for TASKS
        ;; TODO means it's an item that needs addressing
        ;; WAITING means it's dependent on something else happening
        ;; DELEGATED means someone else is doing it and I need to follow up with them
        ;; ASSIGNED means someone else has full, autonomous responsibility for it
        ;; CANCELLED means it's no longer necessary to finish
        ;; DONE means it's complete
        (sequence "TODO(t@/!)" "WAITING(w@/!)" "DELEGATED(e@/!)" "|" "ASSIGNED(a@/!)" "CANCELLED(c@/!)" "DONE(d@/!)")
        ))
;; put - STATE change from xx to xx into drawer so when export,
;; these state changes won't be exported
(setq org-log-into-drawer t)

(setq org-babel-load-languages
      (quote
       ((emacs-lisp . t)
        (shell . t)
        (python . t)
        (awk . t)
        (C . t)
        (java . t)
        (latex . t)
        (makefile . t)
        (octave . t))))

(setq org-export-backends (quote (ascii html latex man md odt groff)))

(require 'org)
(define-key org-mode-map (kbd "C-c %") 'org-mark-ring-goto)

;; Remove all backup files
;; (setq make-backup-files nil)
;; (setq backup-inhibited t)
;; (setq auto-save-default nil)
;; or alternatively
(setq backup-directory-alist '(("." . "~/.saves")))

(setq-default c-default-style "linux")
(setq-default c-basic-offset 4)
(c-set-offset 'case-label '+)           ; fix case index

(setq python-indent-offset 4)

(add-to-list 'auto-mode-alist '("\\.scons\\'" . python-mode))
(add-to-list 'auto-mode-alist '("\\.api\\'" . python-mode))

(add-to-list 'auto-mode-alist '("\\.mak\\'" . makefile-mode))

(require 'dired-x)

(setq dired-dwim-target t)

(setq nxml-slash-auto-complete-flag t)

(add-hook 'before-save-hook 'whitespace-cleanup)
(add-hook 'before-save-hook (lambda() (delete-trailing-whitespace)))
