config.org
** recentf location
   use local disk instead of network drive
   #+BEGIN_SRC emacs-lisp :tangle yes
     (setq recentf-save-file "/local/mnt/workspace/.recentf")
   #+END_SRC

   History of why I changed this and changed it back. First off, it should not be changed, otherwise it won't be portable. Reason why I changed this was I suspect the recent file was the reason why helm-mini was slow. But change this won't help. Indeed, the slowness of helm-mini was due to the recentf, because helm-buffer-list was instant but helm-mini was not, and the only difference between the two was recentf was present in helm-mini. So I found the command helm-recentf, and it is *VERY SLOW*. It appears that there are 2 files inside recentf that were from a network scratch disk, which was very slow to access. Problem solved by removing these 2 files from the recentf list. Now problem is why the helm-recentf needs to check the actual file itself instead of just load the list file?

** ibuffer
Disable this due to slow performance
=from emacs wiki=

 - ‘M-s a C-s’ - Do incremental search in the marked buffers.
 - ‘M-s a C-M-s’ - Isearch for regexp in the marked buffers.
 - ‘U’ - Replace by regexp in each of the marked buffers.
 - ‘Q’ - Query replace in each of the marked buffers.
 - ‘I’ - As above, with a regular expression.
 - ‘0’ - Run occur on the marked buffers.

*** view subset of buffers
Also try ibuffer’s “limiting” feature (‘/’), which allows you to just view a subset of your buffers.

*** Diff
Ibuffer can show you the differences between an unsaved buffer and the file on disk with `=’.

*** Grouping
#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key (kbd "C-x C-b") 'buffer-menu) ; not use default list-buffers because it will not focus on the buffer list
#+END_SRC

#+RESULTS:
: buffer-menu

#+BEGIN_SRC emacs-lisp :tangle no
  (global-set-key (kbd "C-x C-b") 'ibuffer)


  ;; (add-to-list 'ibuffer-never-show-regexps "^\\*")

  ;; Gnus-style grouping

  ;; (setq ibuffer-saved-filter-groups
  ;;       (quote (("work"
  ;;                ("dired" (mode . dired-mode))
  ;;                ("org" (mode. org-mode))
                 ;; ("c" (mode . c-mode))
                 ;; ("c++" (mode . c++-mode))
                 ;; ("python" (mode . python-mode))
                 ;; ("perl" (mode . cperl-mode))
                 ;; ("shell" (or
                 ;;           (mode . shell-script-mode)
                 ;;           (mode . sh-mode)))
                 ;; ("xml" (mode . nxml-mode))
                 ;; ("erc" (mode . erc-mode))
                 ;; ("journal" (filename . "/personal/journal/"))
                 ;; ("planner" (or
                 ;;             (name . "^\\*Calendar\\*$")
                 ;;             (name . "^diary$")
                 ;;             (mode . muse-mode)))
                 ;; ("emacs" (or
                 ;;           (name . "^\\*scratch\\*$")
                 ;;           (name . "^\\*Messages\\*$")))
                 ;; ("gnus" (or
                 ;;          (mode . message-mode)
                 ;;          (mode . bbdb-mode)
                 ;;          (mode . mail-mode)
                 ;;          (mode . gnus-group-mode)
                 ;;          (mode . gnus-summary-mode)
                 ;;          (mode . gnus-article-mode)
                 ;;          (name . "^\\.bbdb$")
                 ;;          (name . "^\\.newsrc-dribble")))))))
  ;;                ))))

  ;; (add-hook 'ibuffer-mode-hook
  ;;           '(lambda ()
               ;; (ibuffer-auto-mode 1)      ;auto update ibuffer
               ;; (ibuffer-switch-to-saved-filter-groups "work")))

  ;; ibuffer-expert
  ;; don't ask for confirmation when deleting buffers
  (setq ibuffer-expert t)

  ;; don't show empty groups

  ;; (setq ibuffer-show-empty-filter-groups nil)
#+END_SRC

** Abbrev mode
turn on abbrev minor mode for some major modes

M-x edit-abbrevs to edit the tables C-x C-s to save it

#+BEGIN_SRC emacs-lisp :tangle yes
  (add-hook 'org-mode-hook 'abbrev-mode)
  (add-hook 'shell-mode 'abbrev-mode)
#+END_SRC
** miscellaneous

   Emacs 25 add new variable package-selected-packages, every time you open packages, the customize.el will add this variable to your init.el or .emacs. To prevent it from doing this, add this, so custom.el will be used to hold that data, but never source control it.

   #+BEGIN_SRC emacs-lisp :tangle yes
     (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
   #+END_SRC
** global key bindings
#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key (kbd "C-x t") 'eshell)
  (global-set-key (kbd "C-x y") 'shell)

#+END_SRC
** undo limit
Increase the limits for reading logs and many line flushes
#+BEGIN_SRC emacs-lisp :tangle no
  (setq undo-limit 100000000)             ; 100M
  (setq undo-outer-limit 150000000)       ; 150M
  (setq undo-strong-limit 200000000)      ; 200M
#+END_SRC
* Packages

** ivy, counsel, swiper

How to use *Nuclear weapon of multi-editing* in Ivy?
In helm, you can use helm-ag to search and C-c C-e to open results in another window, and then edit them, and then C-c C-c to commit.
In Ivy, you use counsel-ag to search and C-c C-o (Ivy-occur) to open results in another window, and then C-x C-q (ivy-wgrep-change-to-wgrep-mode, this simply just enable edit mode) to enable editing, and make changes, and C-x C-s to save changes. (Files not saved, though). One more step but acceptable

*Helm-multi-occur*
In helm, C-x b open buffer list, C-spc to mark buffers, C-s to search within marked buffers

This seems to be missing in Ivy (main reason is that, in ivy minibuffer, you cannot mark buffers)

#+begin_src emacs-lisp :tangle no

  (setq ivy-use-virtual-buffers t)        ;
  (setq ivy-count-format "(%d/%d) ")
  (setq ivy-initial-inputs-alist nil)     ;remove ^

  (setq ivy-height-alist
        '((t
           lambda (_caller)
           (/ (* (frame-height) 2) 5))))

  (global-set-key (kbd "C-s") 'swiper)
  (global-set-key (kbd "M-x") 'counsel-M-x)
  (global-set-key (kbd "C-c h g") 'counsel-ag)

  (ivy-mode 1)
  (counsel-mode 1)
  ;; use amx instead, ivy-prescient will alter ag results as well, not wanted.
  ;; amx must be installed, it will be auto-picked by ivy, amx is forked from smex, which stays at 2015 release (old)
  ;; (ivy-prescient-mode)
  ;; this must be after counsel is loaded
  (define-key counsel-mode-map (kbd "C-c h i") 'counsel-semantic-or-imenu)
#+end_src
** counsel-gtags
#+BEGIN_SRC emacs-lisp :tangle no
  (add-hook 'c-mode-hook 'counsel-gtags-mode)
  (add-hook 'c++-mode-hook 'counsel-gtags-mode)
  (add-hook 'java-mode-hook 'counsel-gtags-mode)
  (add-hook 'asm-mode-hook 'counsel-gtags-mode)
  ;; use elpy-goto-definition instead
  ;; (add-hook 'python-mode-hook 'counsel-gtags-mode)

  (with-eval-after-load 'counsel-gtags
    (define-key counsel-gtags-mode-map (kbd "M-.") 'counsel-gtags-dwim)
    ;; (define-key counsel-gtags-mode-map (kbd "M-t") 'counsel-gtags-find-definition)
    ;; (define-key counsel-gtags-mode-map (kbd "M-r") 'counsel-gtags-find-reference)
    ;; (define-key counsel-gtags-mode-map (kbd "M-s") 'counsel-gtags-find-symbol)
    (define-key counsel-gtags-mode-map (kbd "M-,") 'counsel-gtags-go-backward))
     #+END_SRC

** counsel-projectile
#+BEGIN_SRC emacs-lisp :tangle no
  (counsel-projectile-mode)
  (projectile-mode t)

  ;; after upgrade packages need to add this
  (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
  (setq projectile-enable-caching t)
  (setq projectile-globally-ignored-directories
        (quote
         (".idea" ".eunit" ".git" ".hg" ".fslckout" ".bzr" "_darcs" ".tox" ".svn" ".stack-work" "Debug*")))
  (setq projectile-globally-ignored-file-suffixes
        (quote
         ("o" "so" "lib" "a" "pyc" "elf" "lst" "suo" "sdf" "vtg" "mdt" "bin")))
  (setq projectile-globally-ignored-files (quote ("TAGS" "GTAGS" "GPATH" "GRTAGS")))
  (setq projectile-completion-system 'ivy)

  ;; change projectile indexing method for Windows
  (cond ((eq system-type 'windows-nt)
         (setq projectile-indexing-method 'alien)))
#+END_SRC

** helm
   #+BEGIN_SRC emacs-lisp :tangle yes
     (require 'helm-config)

     ;; The default "C-x c" is quite close to "C-x C-c", which quits Emacs.
     ;; Changed to "C-c h". Note: We must set "C-c h" globally, because we
     ;; cannot change `helm-command-prefix-key' once `helm-config' is loaded.
     (global-set-key (kbd "C-c h") 'helm-command-prefix)
     (global-unset-key (kbd "C-x c"))

     (global-set-key (kbd "M-x") 'helm-M-x)
     (global-set-key (kbd "M-y") 'helm-show-kill-ring)
     (global-set-key (kbd "C-x b") 'helm-mini)
     (global-set-key (kbd "C-x C-f") 'helm-find-files)

     ;; for search, still use c-s
     ;; for read only helm-occur (C-c h M-s o), I bind it to replace occur (M-s o)
     (global-set-key (kbd "M-s o") 'helm-occur)
     ;; for multi editing search, use helm-swoop (M-i) see below section
     ;; no more, helm-swoop is slow for large files, helm-occur is much faster
     ;; swiper is in between in terms of performance
     ;; this is to enable edit mode automatically (could bind it to C-x C-q to manually
     ;; use it) see https://github.com/emacs-helm/helm/issues/2146
     (add-hook 'helm-occur-mode-hook 'wgrep-change-to-wgrep-mode t)

     ;; make helm open at bottom with full frame width
     (add-to-list 'display-buffer-alist
                  `(,(rx bos "*helm" (* not-newline) "*" eos)
                    (display-buffer-in-side-window)
                    (inhibit-same-window . t)
                    (window-height . 0.4)))
     ;; (define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action) ; rebind tab to run persistent action
     ;; (define-key helm-map (kbd "C-i") 'helm-execute-persistent-action) ; make TAB works in terminal
     ;; (define-key helm-map (kbd "C-z") 'helm-select-action) ; list actions using C-z

     ;; (when (executable-find "curl")
     ;;   (setq helm-google-suggest-use-curl-p t)) ;not sure what this is for

     (setq
      ;; helm-split-window-in-side-p           t ; open helm buffer inside current window, not occupy whole other window
           ;; helm-move-to-line-cycle-in-source     t ; move to end or beginning of source when reaching top or bottom of source.
           helm-ff-search-library-in-sexp        t ; search for library in `require' and `declare-function' sexp.
           helm-scroll-amount                    8 ; scroll 8 lines other window using M-<next>/M-<prior>
           ;; helm-ff-file-name-history-use-recentf t
           )

     (helm-mode 1)                           ; turn on helm mode for kill buffer etc

   #+END_SRC

