config.el

(global-set-key (kbd "C-x C-b") 'buffer-menu) ; not use default list-buffers because it will not focus on the buffer list

(add-hook 'org-mode-hook 'abbrev-mode)
(add-hook 'shell-mode 'abbrev-mode)

(setq custom-file (expand-file-name "custom.el" user-emacs-directory))

(global-set-key (kbd "C-x t") 'eshell)
(global-set-key (kbd "C-x y") 'shell)

(use-package all-the-icons)
(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1))

(require 'helm-config)

;; The default "C-x c" is quite close to "C-x C-c", which quits Emacs.
;; Changed to "C-c h". Note: We must set "C-c h" globally, because we
;; cannot change `helm-command-prefix-key' once `helm-config' is loaded.
(global-set-key (kbd "C-c h") 'helm-command-prefix)
(global-unset-key (kbd "C-x c"))

(global-set-key (kbd "M-x") 'helm-M-x)
(global-set-key (kbd "M-y") 'helm-show-kill-ring)
(global-set-key (kbd "C-x b") 'helm-mini)
(global-set-key (kbd "C-x C-f") 'helm-find-files)

;; for search, still use c-s
;; for read only helm-occur (C-c h M-s o), I bind it to replace occur (M-s o)
(global-set-key (kbd "M-s o") 'helm-occur)
;; for multi editing search, use helm-swoop (M-i) see below section
;; no more, helm-swoop is slow for large files, helm-occur is much faster
;; swiper is in between in terms of performance
;; this is to enable edit mode automatically (could bind it to C-x C-q to manually
;; use it) see https://github.com/emacs-helm/helm/issues/2146
(add-hook 'helm-occur-mode-hook 'wgrep-change-to-wgrep-mode t)

;; make helm open at bottom with full frame width
(add-to-list 'display-buffer-alist
             `(,(rx bos "*helm" (* not-newline) "*" eos)
               (display-buffer-in-side-window)
               (inhibit-same-window . t)
               (window-height . 0.4)))
;; (define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action) ; rebind tab to run persistent action
;; (define-key helm-map (kbd "C-i") 'helm-execute-persistent-action) ; make TAB works in terminal
;; (define-key helm-map (kbd "C-z") 'helm-select-action) ; list actions using C-z

;; (when (executable-find "curl")
;;   (setq helm-google-suggest-use-curl-p t)) ;not sure what this is for

(setq
 ;; helm-split-window-in-side-p           t ; open helm buffer inside current window, not occupy whole other window
      ;; helm-move-to-line-cycle-in-source     t ; move to end or beginning of source when reaching top or bottom of source.
      helm-ff-search-library-in-sexp        t ; search for library in `require' and `declare-function' sexp.
      helm-scroll-amount                    8 ; scroll 8 lines other window using M-<next>/M-<prior>
      ;; helm-ff-file-name-history-use-recentf t
      )

(helm-mode 1)                           ; turn on helm mode for kill buffer etc
