config.org
** helm-gtags
   #+BEGIN_SRC emacs-lisp :tangle yes
     (require 'helm-gtags)
     ;; (add-hook 'dired-mode-hook 'helm-gtags-mode)
     ;; (add-hook 'eshell-mode-hook 'helm-gtags-mode)
     (add-hook 'c-mode-hook 'helm-gtags-mode)
     (add-hook 'c++-mode-hook 'helm-gtags-mode)
     (add-hook 'java-mode-hook 'helm-gtags-mode)
     (add-hook 'asm-mode-hook 'helm-gtags-mode)
     ;; for python, use elpy-goto-definition (same key)
     ;; (add-hook 'python-mode-hook 'helm-gtags-mode)

     (setq helm-gtags-auto-update t)
     (setq helm-gtags-suggested-key-mapping t)

     ;; key bindings
     (eval-after-load "helm-gtags"
       '(progn
          (define-key helm-gtags-mode-map (kbd "M-.") 'helm-gtags-dwim)
          ;; (define-key helm-gtags-mode-map (kbd "M-t") 'helm-gtags-find-tag)
          ;; (define-key helm-gtags-mode-map (kbd "M-r") 'helm-gtags-find-rtag)
          ;; (define-key helm-gtags-mode-map (kbd "M-s") 'helm-gtags-find-symbol)
          ;; (define-key helm-gtags-mode-map (kbd "M-g M-p") 'helm-gtags-parse-file)
          (define-key helm-gtags-mode-map (kbd "C-c <") 'helm-gtags-previous-history)
          (define-key helm-gtags-mode-map (kbd "C-c >") 'helm-gtags-next-history)
          (define-key helm-gtags-mode-map (kbd "M-,") 'helm-gtags-pop-stack)))

     ;; key bindings (old)
     ;; (define-key helm-gtags-mode-map (kbd "M-.") 'helm-gtags-dwim)
     ;; (define-key helm-gtags-mode-map (kbd "M-,") 'helm-gtags-pop-stack)
     ;; (define-key helm-gtags-mode-map (kbd "C-c <") 'helm-gtags-previous-history)
     ;; (define-key helm-gtags-mode-map (kbd "C-c >") 'helm-gtags-next-history)
     ;; (define-key helm-gtags-mode-map (kbd "C-x k") 'kill-buffer)
     (provide 'setup-helm-gtags)
   #+END_SRC
** helm-projectile
   #+BEGIN_SRC emacs-lisp :tangle yes
     (helm-projectile-on)
     (projectile-mode t)
     (setq projectile-enable-caching t)
     (setq projectile-globally-ignored-directories
      (quote
       (".idea" ".eunit" ".git" ".hg" ".fslckout" ".bzr" "_darcs" ".tox" ".svn" ".stack-work" "Debug*")))
     (setq projectile-globally-ignored-file-suffixes
      (quote
       ("o" "so" "lib" "a" "pyc" "elf" "lst" "suo" "sdf" "vtg" "mdt" "bin")))
     (setq projectile-globally-ignored-files (quote ("TAGS" "GTAGS" "GPATH" "GRTAGS")))

     (setq projectile-completion-system 'helm)
     ;; after upgrade packages need to add this
     (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)

     ;; change projectile indexing method for Windows
     ;; (cond ((eq system-type 'windows-nt)
     ;;        (setq projectile-indexing-method 'alien)))
     ;; now change indexing to hybrid for all platforms, for new version of
     ;; projectile this is fast enough even on Windows, and also alien method
     ;; won't allow using .projectile file
     ;; I am using .projectile file to exclude some files/dirs
     ;; I am using .dir-locals.el to customize compilation dir and cmd2
     (setq projectile-indexing-method 'hybrid)
   #+END_SRC

** helm-swoop
#+BEGIN_SRC emacs-lisp :tangle no
  ;; helm from https://github.com/emacs-helm/helm
  (require 'helm)

  ;; Locate the helm-swoop folder to your path
  (add-to-list 'load-path "~/.emacs.d/elisp/helm-swoop")
  (require 'helm-swoop)

  ;; Change the keybinds to whatever you like :)
  (global-set-key (kbd "M-i") 'helm-swoop)
  (global-set-key (kbd "M-I") 'helm-swoop-back-to-last-point)
  (global-set-key (kbd "C-c M-i") 'helm-multi-swoop)
  (global-set-key (kbd "C-x M-i") 'helm-multi-swoop-all)

  ;; When doing isearch, hand the word over to helm-swoop
  (define-key isearch-mode-map (kbd "M-i") 'helm-swoop-from-isearch)
  ;; From helm-swoop to helm-multi-swoop-all
  (define-key helm-swoop-map (kbd "M-i") 'helm-multi-swoop-all-from-helm-swoop)
  ;; When doing evil-search, hand the word over to helm-swoop
  ;; (define-key evil-motion-state-map (kbd "M-i") 'helm-swoop-from-evil-search)

  ;; Instead of helm-multi-swoop-all, you can also use helm-multi-swoop-current-mode
  (define-key helm-swoop-map (kbd "M-m") 'helm-multi-swoop-current-mode-from-helm-swoop)

  ;; Move up and down like isearch
  (define-key helm-swoop-map (kbd "C-r") 'helm-previous-line)
  (define-key helm-swoop-map (kbd "C-s") 'helm-next-line)
  (define-key helm-multi-swoop-map (kbd "C-r") 'helm-previous-line)
  (define-key helm-multi-swoop-map (kbd "C-s") 'helm-next-line)

  ;; Save buffer when helm-multi-swoop-edit complete
  (setq helm-multi-swoop-edit-save t)

  ;; If this value is t, split window inside the current window
  (setq helm-swoop-split-with-multiple-windows nil)

  ;; Split direcion. 'split-window-vertically or 'split-window-horizontally
  (setq helm-swoop-split-direction 'split-window-vertically)

  ;; If nil, you can slightly boost invoke speed in exchange for text color
  (setq helm-swoop-speed-or-color t)

  ;; ;; Go to the opposite side of line from the end or beginning of line
  (setq helm-swoop-move-to-line-cycle t)

  ;; Optional face for line numbers
  ;; Face name is `helm-swoop-line-number-face`
  (setq helm-swoop-use-line-number-face t)

  ;; If you prefer fuzzy matching
  (setq helm-swoop-use-fuzzy-match nil)

  ;; If you would like to use migemo, enable helm's migemo feature
  ;; (helm-migemo-mode 1)

#+END_SRC
** helm-ag
add key bindings
#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key (kbd "C-c h g") 'helm-ag)
  (global-set-key (kbd "C-c h d") 'helm-do-ag)
  ;; automatically turn to wgrep mode if C-c C-s if pressed
  (add-hook 'helm-ag-mode-hook 'wgrep-change-to-wgrep-mode t)

#+END_SRC

#+RESULTS:
: helm-do-ag
** auto remove old packages
#+BEGIN_SRC emacs-lisp :tangle yes
(setq auto-package-update-delete-old-version t)
#+END_SRC
** window-numbering
   #+BEGIN_SRC emacs-lisp :tangle yes
     (window-numbering-mode 1)
   #+END_SRC

** Version Control
*** magit

    #+BEGIN_SRC emacs-lisp :tangle yes
      (if (eq system-type 'windows-nt)
          (setq magit-git-executable "c:\\Program Files\\Git\\bin\\git.exe")
        )
      (global-set-key (kbd "C-x g") 'magit-status)
      (global-set-key (kbd "C-x M-g") 'magit-dispatch-popup)
      ;; turn off diff when doing commit, use C-c C-d to see the diff manually
      ;; if not turned off, for large commits, it will be very slow, alternative
      ;; way is to C-g to cancel diff when committing, but will end up with an
      ;; broken diff buffer
      (remove-hook 'server-switch-hook 'magit-commit-diff)
    #+END_SRC

*** p4
    #+BEGIN_SRC emacs-lisp :tangle no
      (load-library "p4")
    #+END_SRC

** grep-a-lot
   #+BEGIN_SRC emacs-lisp :tangle no
     (require 'grep-a-lot)
     (grep-a-lot-setup-keys)
   #+END_SRC
** org-bullets
   #+BEGIN_SRC emacs-lisp :tangle yes
     (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
   #+END_SRC
** org-web-tools
Install pandoc (needed), install org-web-tools from the MELPA
** yasnippet

   only enable yas-minor-mode for certain major modes

   #+begin_src emacs-lisp :tangle yes
     (require 'yasnippet)
     (yas-reload-all)
     (add-hook 'org-mode-hook #'yas-minor-mode)
     (add-hook 'c-mode-hook #'yas-minor-mode)
     (add-hook 'c++-mode-hook #'yas-minor-mode)
     (add-hook 'python-mode-hook #'yas-minor-mode)
     (add-hook 'sh-mode-hook #'yas-minor-mode)
     (add-hook 'nroff-mode-hook #'yas-minor-mode)
     (add-hook 'LaTeX-mode-hook #'yas-minor-mode)
     (add-hook 'nxml-mode-hook #'yas-minor-mode)
   #+end_src

** notmuch-emacs

frontend for notmuch

Some helpful commands
- view message in external viewer (browser), use . v
- search anything use s
- display tags use t


   #+BEGIN_SRC emacs-lisp :tangle no
     (autoload 'notmuch "notmuch" "notmuch mail" t)
     ;; (require 'notmuch)  ;; always load when start emacs
     (setq notmuch-search-oldest-first nil)
     (setq mail-specify-envelope-from t)
     (setq mail-specify-envelope-from (quote header))
     (setq message-sendmail-envelope-from (quote header))
     (setq send-mail-function (quote sendmail-send-it))
     (setq message-cite-function (quote message-cite-original))
     (setq message-cite-style (quote message-cite-style-outlook))
     (setq message-yank-cited-prefix "")
     (setq message-yank-empty-prefix "")
     (setq message-yank-prefix "")
     (setq notmuch-show-all-tags-list t)     ; show all tags in hello screen
     (require 'ol-notmuch)                  ; store links in notmuch buffers (was called org-notmuch, recently renamed to ol-notmuch)
   #+END_SRC

** company mode
   global mode will slow down eshell even hang it.
   #+BEGIN_SRC emacs-lisp :tangle yes
     ;; (add-hook 'after-init-hook 'global-company-mode)
     (add-hook 'c-mode-hook 'company-mode)
     (add-hook 'c++-mode-hook 'company-mode)
     (add-hook 'text-mode-hook 'company-mode)
     (add-hook 'sh-mode-hook 'company-mode)
     (add-hook 'python-mode-hook 'company-mode)
     (add-hook 'emacs-lisp-mode-hook 'company-mode)
     (add-hook 'org-mode-hook 'company-mode)
     (add-hook 'lisp-mode-hook 'company-mode)
   #+END_SRC

** irony-mode
   #+BEGIN_SRC emacs-lisp :tangle yes
     (add-hook 'c-mode-hook 'irony-mode)
     (add-hook 'c++-mode-hook 'irony-mode)

     ;; Windows performance tweaks
     ;;
     (when (boundp 'w32-pipe-read-delay)
       (setq w32-pipe-read-delay 0))
     ;; Set the buffer size to 64K on Windows (from the original 4K)
     (when (boundp 'w32-pipe-buffer-size)
       (setq irony-server-w32-pipe-buffer-size (* 64 1024)))
   #+END_SRC

** company-irony
   use this as backend instead of company-clang for C/C++/Objective-C
   #+BEGIN_SRC emacs-lisp :tangle yes
     (eval-after-load 'company
       '(add-to-list 'company-backends '(company-irony-c-headers company-irony)))
     (add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options)
   #+END_SRC

** diminish
NOTE mode must be diminished after it's loaded (eval-after-load)

   #+BEGIN_SRC emacs-lisp :tangle no
     (require 'diminish)
     ;; (diminish 'helm-mode)
     ;; (diminish 'abbrev-mode)
     ;; (diminish 'projectile-mode)
     ;; (diminish 'company-mode)
     ;; (diminish 'irony-mode)
     ;; (diminish 'yas-minor-mode)
     ;; (diminish 'helm-gtags-mode)
     ;; (diminish 'org-src-mode)
     ;; (diminish 'smartparens-mode)
     ;; (diminish 'undo-tree-mode)
     ;; (diminish 'which-key-mode)
     ;; (diminish 'eldoc-mode)
     (eval-after-load "filladapt" '(diminish 'helm-mode))
     (eval-after-load "filladapt" '(diminish 'abbrev-mode))
     (eval-after-load "filladapt" '(diminish 'projectile-mode))
     (eval-after-load "filladapt" '(diminish 'company-mode))
     (eval-after-load "filladapt" '(diminish 'irony-mode))
     (eval-after-load "filladapt" '(diminish 'yas-minor-mode))
     (eval-after-load "filladapt" '(diminish 'helm-gtags-mode))
     (eval-after-load "filladapt" '(diminish 'org-src-mode))
     (eval-after-load "filladapt" '(diminish 'smartparens-mode))
     (eval-after-load "filladapt" '(diminish 'undo-tree-mode))
     (eval-after-load "filladapt" '(diminish 'which-key-mode))
     (eval-after-load "filladapt" '(diminish 'eldoc-mode))
   #+END_SRC

