config.el

(require 'helm-gtags)
;; (add-hook 'dired-mode-hook 'helm-gtags-mode)
;; (add-hook 'eshell-mode-hook 'helm-gtags-mode)
(add-hook 'c-mode-hook 'helm-gtags-mode)
(add-hook 'c++-mode-hook 'helm-gtags-mode)
(add-hook 'java-mode-hook 'helm-gtags-mode)
(add-hook 'asm-mode-hook 'helm-gtags-mode)
;; for python, use elpy-goto-definition (same key)
;; (add-hook 'python-mode-hook 'helm-gtags-mode)

(setq helm-gtags-auto-update t)
(setq helm-gtags-suggested-key-mapping t)

;; key bindings
(eval-after-load "helm-gtags"
  '(progn
     (define-key helm-gtags-mode-map (kbd "M-.") 'helm-gtags-dwim)
     ;; (define-key helm-gtags-mode-map (kbd "M-t") 'helm-gtags-find-tag)
     ;; (define-key helm-gtags-mode-map (kbd "M-r") 'helm-gtags-find-rtag)
     ;; (define-key helm-gtags-mode-map (kbd "M-s") 'helm-gtags-find-symbol)
     ;; (define-key helm-gtags-mode-map (kbd "M-g M-p") 'helm-gtags-parse-file)
     (define-key helm-gtags-mode-map (kbd "C-c <") 'helm-gtags-previous-history)
     (define-key helm-gtags-mode-map (kbd "C-c >") 'helm-gtags-next-history)
     (define-key helm-gtags-mode-map (kbd "M-,") 'helm-gtags-pop-stack)))

;; key bindings (old)
;; (define-key helm-gtags-mode-map (kbd "M-.") 'helm-gtags-dwim)
;; (define-key helm-gtags-mode-map (kbd "M-,") 'helm-gtags-pop-stack)
;; (define-key helm-gtags-mode-map (kbd "C-c <") 'helm-gtags-previous-history)
;; (define-key helm-gtags-mode-map (kbd "C-c >") 'helm-gtags-next-history)
;; (define-key helm-gtags-mode-map (kbd "C-x k") 'kill-buffer)
(provide 'setup-helm-gtags)

(helm-projectile-on)
(projectile-mode t)
(setq projectile-enable-caching t)
(setq projectile-globally-ignored-directories
 (quote
  (".idea" ".eunit" ".git" ".hg" ".fslckout" ".bzr" "_darcs" ".tox" ".svn" ".stack-work" "Debug*")))
(setq projectile-globally-ignored-file-suffixes
 (quote
  ("o" "so" "lib" "a" "pyc" "elf" "lst" "suo" "sdf" "vtg" "mdt" "bin")))
(setq projectile-globally-ignored-files (quote ("TAGS" "GTAGS" "GPATH" "GRTAGS")))

(setq projectile-completion-system 'helm)
;; after upgrade packages need to add this
(define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)

;; change projectile indexing method for Windows
;; (cond ((eq system-type 'windows-nt)
;;        (setq projectile-indexing-method 'alien)))
;; now change indexing to hybrid for all platforms, for new version of
;; projectile this is fast enough even on Windows, and also alien method
;; won't allow using .projectile file
;; I am using .projectile file to exclude some files/dirs
;; I am using .dir-locals.el to customize compilation dir and cmd2
(setq projectile-indexing-method 'hybrid)

(global-set-key (kbd "C-c h g") 'helm-ag)
(global-set-key (kbd "C-c h d") 'helm-do-ag)
;; automatically turn to wgrep mode if C-c C-s if pressed
(add-hook 'helm-ag-mode-hook 'wgrep-change-to-wgrep-mode t)

(setq auto-package-update-delete-old-version t)

(window-numbering-mode 1)

(if (eq system-type 'windows-nt)
    (setq magit-git-executable "c:\\Program Files\\Git\\bin\\git.exe")
  )
(global-set-key (kbd "C-x g") 'magit-status)
(global-set-key (kbd "C-x M-g") 'magit-dispatch-popup)
;; turn off diff when doing commit, use C-c C-d to see the diff manually
;; if not turned off, for large commits, it will be very slow, alternative
;; way is to C-g to cancel diff when committing, but will end up with an
;; broken diff buffer
(remove-hook 'server-switch-hook 'magit-commit-diff)

;; (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
(require 'org-superstar)
(add-hook 'org-mode-hook (lambda () (org-superstar-mode 1)))

(require 'yasnippet)
(yas-reload-all)
(add-hook 'org-mode-hook #'yas-minor-mode)
(add-hook 'c-mode-hook #'yas-minor-mode)
(add-hook 'c++-mode-hook #'yas-minor-mode)
(add-hook 'python-mode-hook #'yas-minor-mode)
(add-hook 'sh-mode-hook #'yas-minor-mode)
(add-hook 'nroff-mode-hook #'yas-minor-mode)
(add-hook 'LaTeX-mode-hook #'yas-minor-mode)
(add-hook 'nxml-mode-hook #'yas-minor-mode)

;; (add-hook 'after-init-hook 'global-company-mode)
(add-hook 'c-mode-hook 'company-mode)
(add-hook 'c++-mode-hook 'company-mode)
(add-hook 'text-mode-hook 'company-mode)
(add-hook 'sh-mode-hook 'company-mode)
(add-hook 'python-mode-hook 'company-mode)
(add-hook 'emacs-lisp-mode-hook 'company-mode)
(add-hook 'org-mode-hook 'company-mode)
(add-hook 'lisp-mode-hook 'company-mode)

(add-hook 'c-mode-hook 'irony-mode)
(add-hook 'c++-mode-hook 'irony-mode)

;; Windows performance tweaks
;;
(when (boundp 'w32-pipe-read-delay)
  (setq w32-pipe-read-delay 0))
;; Set the buffer size to 64K on Windows (from the original 4K)
(when (boundp 'w32-pipe-buffer-size)
  (setq irony-server-w32-pipe-buffer-size (* 64 1024)))

(eval-after-load 'company
  '(add-to-list 'company-backends '(company-irony-c-headers company-irony)))
(add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options)
