config.el

(require 'delight)
;; (delight 'helm-mode)
;; (delight 'abbrev-mode)
;; (delight 'projectile-mode)
;; (delight 'company-mode)
;; (delight 'irony-mode)
;; (delight 'yas-minor-mode)
;; (delight 'helm-gtags-mode)
;; (delight 'org-src-mode)
;; (delight 'smartparens-mode)
;; (delight 'undo-tree-mode)
;; (delight 'which-key-mode)
;; (delight 'eldoc-mode')
(delight '((helm-mode nil helm)
           (abbrev-mode nil abbrev)
           (projectile-mode nil projectile)
           (company-mode nil company)
           (irony-mode nil irony)
           (yas-minor-mode nil yasnippet)
           (helm-gtags-mode nil helm-gtags)
           (org-src-mode nil org-src)
           (smartparens-mode nil smartparens)
           (undo-tree-mode nil undo-tree)
           (which-key-mode nil which-key)
           (eldoc-mode nil eldoc)
           (captain-mode nil captain)
           (org-indent-mode nil org-indent)
           (counsel-mode nil counsel)
           (ivy-mode nil ivy)
           ))

(cond ((eq system-type 'darwin)
       (exec-path-from-shell-initialize)))

(require 'bm)
(global-set-key (kbd "<C-f2>") 'bm-toggle)
(global-set-key (kbd "<f2>")   'bm-next)
(global-set-key (kbd "<S-f2>") 'bm-show-all)
;; (global-set-key (kbd "<S-f2>") 'bm-previous)
;; Click on fringe to toggle bookmarks, and use mouse wheel to move between them.
(global-set-key (kbd "<left-fringe> <mouse-5>") 'bm-next-mouse)
(global-set-key (kbd "<left-fringe> <mouse-4>") 'bm-previous-mouse)
(global-set-key (kbd "<left-fringe> <mouse-1>") 'bm-toggle-mouse)
;; If you would like to cycle through bookmarks in all open buffers, add the following line:
(setq bm-cycle-all-buffers t)

(setq TeX-save-query nil)
(cond ((eq system-type 'windows-nt)
       (setq TeX-view-program-list
             '(("Sumatra PDF"
                ("\"c:/Program Files/SumatraPDF/SumatraPDF.exe\" -reuse-instance"
                 (mode-io-correlate " -forward-search \"%b\" %n ") " %o"))))
       (setq TeX-view-program-selection
             '(((output-dvi style-pstricks) "dvips and start") (output-dvi "Yap")
               (output-pdf "Sumatra PDF") (output-html "start"))))
      )

(advice-add 'python-mode :before 'elpy-enable)
;; (add-hook 'elpy-mode-hook
;;           '(lambda () (local-unset-key (kbd "M-.") 'xref-find-definitions)))
(add-hook 'elpy-mode-hook
          '(lambda () (local-set-key (kbd "M-.") 'elpy-goto-definition)))
(add-hook 'elpy-mode-hook
          '(lambda () (local-set-key (kbd "M-]") 'xref-find-definitions)))

(which-key-mode)

(require 'undo-tree)
(global-undo-tree-mode)

(require 'smartparens-config)

(add-hook 'c-mode-hook 'smartparens-mode)
(add-hook 'c++-mode-hook 'smartparens-mode)
;; (add-hook 'text-mode-hook 'smartparens-mode)
(add-hook 'sh-mode-hook 'smartparens-mode)
(add-hook 'python-mode-hook 'smartparens-mode)
(add-hook 'emacs-lisp-mode-hook 'smartparens-mode)
(add-hook 'org-mode-hook 'smartparens-mode)
;; (add-hook 'lisp-mode-hook 'smartparens-mode)
;; (add-hook 'nxml-mode-hook 'smartparens-mode)

(define-key dired-mode-map (kbd "/") 'dired-narrow)

(global-captain-mode t)

;; don't capitalize in programming modes. Only in comment
;; Now I still have a problem, which is in comment, the first
;; word is not capitalized. Second sentence is fine.
(add-hook 'prog-mode-hook
   (lambda ()
     (setq captain-predicate
           (lambda () (nth 8 (syntax-ppss (point)))))))

;; Or for text modes, work all the time:
(add-hook 'text-mode-hook
          (lambda ()
            (setq captain-predicate (lambda () t))))

;; Or don't work in source blocks in Org mode:
(add-hook
 'org-mode-hook
 (lambda ()
   (setq captain-predicate
         (lambda () (not (org-in-src-block-p))))))


(setq sentence-end-double-space nil)

(global-set-key (kbd "C-:") 'avy-goto-char)   ;input 1 char
(global-set-key (kbd "C-'") 'avy-goto-char-2) ;input 2 chars
(global-set-key (kbd "M-g f") 'avy-goto-line) ;input chars at line start
(global-set-key (kbd "M-g w") 'avy-goto-word-1) ;input 1 char, goto word
(global-set-key (kbd "M-g e") 'avy-goto-word-0) ;input 0 char(many more options)
(avy-setup-default)
(global-set-key (kbd "C-c C-j") 'avy-resume)

(defun insert-date (prefix)
  "Insert the current date. With prefix-argument, use ISO format. With
   two prefix arguments, write out the day and month name."
  (interactive "P")
  (let ((format (cond
                 ;; ((not prefix) "%d.%m.%Y")
                 ;; ((equal prefix '(4)) "%Y-%m-%d")
                 ((not prefix) "%b. %d, %Y")))
        (system-time-locale "en_US"))
    (insert (format-time-string format))))

(defun toggle-window-split ()
  (interactive)
  (if (= (count-windows) 2)
      (let* ((this-win-buffer (window-buffer))
             (next-win-buffer (window-buffer (next-window)))
             (this-win-edges (window-edges (selected-window)))
             (next-win-edges (window-edges (next-window)))
             (this-win-2nd (not (and (<= (car this-win-edges)
                                         (car next-win-edges))
                                     (<= (cadr this-win-edges)
                                         (cadr next-win-edges)))))
             (splitter
              (if (= (car this-win-edges)
                     (car (window-edges (next-window))))
                  'split-window-horizontally
                'split-window-vertically)))
        (delete-other-windows)
        (let ((first-win (selected-window)))
          (funcall splitter)
          (if this-win-2nd (other-window 1))
          (set-window-buffer (selected-window) this-win-buffer)
          (set-window-buffer (next-window) next-win-buffer)
          (select-window first-win)
          (if this-win-2nd (other-window 1))))))

(defun my-find-file-check-make-large-file-read-only-hook ()
  "If a file is over a given size, make the buffer read only."
  (when (> (buffer-size) (* 1024 1024)) ; 1M size
    ;; (setq buffer-read-only t)
    (buffer-disable-undo)
    (fundamental-mode)))

(add-hook 'find-file-hook 'my-find-file-check-make-large-file-read-only-hook)

(define-key special-event-map [config-changed-event] #'ignore)

(server-start)
